{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "leakyrelu_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "leakyrelu_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_2", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_3", 0, 0], ["convolution2d_2", 0, 0]]], "name": "merge_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "leakyrelu_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "leakyrelu_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_4", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_1", 0, 0], ["convolution2d_5", 0, 0]]], "name": "merge_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_5"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "leakyrelu_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_5", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "batchnormalization_6"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_6"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "leakyrelu_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_6", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_8", 0, 0], ["convolution2d_7", 0, 0]]], "name": "merge_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_7", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "batchnormalization_7"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_7"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "leakyrelu_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "name": "convolution2d_9"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_8", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "batchnormalization_8"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_8"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "name": "leakyrelu_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_8", 0, 0]]], "name": "convolution2d_10"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_3", 0, 0], ["convolution2d_10", 0, 0]]], "name": "merge_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_9", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "batchnormalization_9"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_9"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "leakyrelu_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_9", 0, 0]]], "name": "convolution2d_11"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_10", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "batchnormalization_10"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_10"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "leakyrelu_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [2, 2], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_10", 0, 0]]], "name": "convolution2d_12"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_13", 0, 0], ["convolution2d_12", 0, 0]]], "name": "merge_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_11", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "batchnormalization_11"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_11"}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]], "name": "leakyrelu_11"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_11", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_12", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "batchnormalization_12"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_12"}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]], "name": "leakyrelu_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_16", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "convolution2d_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_12", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_16", 0, 0], ["convolution2d_15", 0, 0]]], "name": "merge_6"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_13", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "batchnormalization_13"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_13"}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]], "name": "leakyrelu_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_17", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_13", 0, 0]]], "name": "convolution2d_17"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_14", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_17", 0, 0]]], "name": "batchnormalization_14"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_14"}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "name": "leakyrelu_14"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_18", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_14", 0, 0]]], "name": "convolution2d_18"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_6", 0, 0], ["convolution2d_18", 0, 0]]], "name": "merge_7"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_15", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "batchnormalization_15"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_15"}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]], "name": "leakyrelu_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_19", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_15", 0, 0]]], "name": "convolution2d_19"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_16", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_19", 0, 0]]], "name": "batchnormalization_16"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_16"}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "name": "leakyrelu_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_20", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_16", 0, 0]]], "name": "convolution2d_20"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_7", 0, 0], ["convolution2d_20", 0, 0]]], "name": "merge_8"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_17", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "batchnormalization_17"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_17"}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "name": "leakyrelu_17"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_21", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_17", 0, 0]]], "name": "convolution2d_21"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_18", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_21", 0, 0]]], "name": "batchnormalization_18"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_18"}, "inbound_nodes": [[["batchnormalization_18", 0, 0]]], "name": "leakyrelu_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_22", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_18", 0, 0]]], "name": "convolution2d_22"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_8", 0, 0], ["convolution2d_22", 0, 0]]], "name": "merge_9"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_19", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "batchnormalization_19"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_19"}, "inbound_nodes": [[["batchnormalization_19", 0, 0]]], "name": "leakyrelu_19"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_23", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_19", 0, 0]]], "name": "convolution2d_23"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_20", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_23", 0, 0]]], "name": "batchnormalization_20"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_20"}, "inbound_nodes": [[["batchnormalization_20", 0, 0]]], "name": "leakyrelu_20"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_25", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [2, 2], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "convolution2d_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_24", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_20", 0, 0]]], "name": "convolution2d_24"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_25", 0, 0], ["convolution2d_24", 0, 0]]], "name": "merge_10"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_21", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "batchnormalization_21"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_21"}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "leakyrelu_21"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_26", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_21", 0, 0]]], "name": "convolution2d_26"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_22", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "batchnormalization_22"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_22"}, "inbound_nodes": [[["batchnormalization_22", 0, 0]]], "name": "leakyrelu_22"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_28", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "convolution2d_28"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_27", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_22", 0, 0]]], "name": "convolution2d_27"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_28", 0, 0], ["convolution2d_27", 0, 0]]], "name": "merge_11"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_23", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "batchnormalization_23"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_23"}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "leakyrelu_23"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_29", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_23", 0, 0]]], "name": "convolution2d_29"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_24", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_29", 0, 0]]], "name": "batchnormalization_24"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_24"}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "name": "leakyrelu_24"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_30", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_24", 0, 0]]], "name": "convolution2d_30"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_11", 0, 0], ["convolution2d_30", 0, 0]]], "name": "merge_12"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_25", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "batchnormalization_25"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_25"}, "inbound_nodes": [[["batchnormalization_25", 0, 0]]], "name": "leakyrelu_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_31", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_25", 0, 0]]], "name": "convolution2d_31"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_26", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_31", 0, 0]]], "name": "batchnormalization_26"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_26"}, "inbound_nodes": [[["batchnormalization_26", 0, 0]]], "name": "leakyrelu_26"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_32", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_26", 0, 0]]], "name": "convolution2d_32"}, {"class_name": "Merge", "config": {"name": "merge_13", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_12", 0, 0], ["convolution2d_32", 0, 0]]], "name": "merge_13"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_27", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "batchnormalization_27"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_27"}, "inbound_nodes": [[["batchnormalization_27", 0, 0]]], "name": "leakyrelu_27"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_33", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_27", 0, 0]]], "name": "convolution2d_33"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_28", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_33", 0, 0]]], "name": "batchnormalization_28"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_28"}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "name": "leakyrelu_28"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_34", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_28", 0, 0]]], "name": "convolution2d_34"}, {"class_name": "Merge", "config": {"name": "merge_14", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_13", 0, 0], ["convolution2d_34", 0, 0]]], "name": "merge_14"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_29", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "batchnormalization_29"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_29"}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "leakyrelu_29"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_35", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_29", 0, 0]]], "name": "convolution2d_35"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_30", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_35", 0, 0]]], "name": "batchnormalization_30"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_30"}, "inbound_nodes": [[["batchnormalization_30", 0, 0]]], "name": "leakyrelu_30"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_36", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_30", 0, 0]]], "name": "convolution2d_36"}, {"class_name": "Merge", "config": {"name": "merge_15", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_14", 0, 0], ["convolution2d_36", 0, 0]]], "name": "merge_15"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_31", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_15", 0, 0]]], "name": "batchnormalization_31"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_31"}, "inbound_nodes": [[["batchnormalization_31", 0, 0]]], "name": "leakyrelu_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_37", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_31", 0, 0]]], "name": "convolution2d_37"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_32", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_37", 0, 0]]], "name": "batchnormalization_32"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_32"}, "inbound_nodes": [[["batchnormalization_32", 0, 0]]], "name": "leakyrelu_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_38", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_32", 0, 0]]], "name": "convolution2d_38"}, {"class_name": "Merge", "config": {"name": "merge_16", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_15", 0, 0], ["convolution2d_38", 0, 0]]], "name": "merge_16"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_33", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_16", 0, 0]]], "name": "batchnormalization_33"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_33"}, "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "name": "leakyrelu_33"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_39", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_33", 0, 0]]], "name": "convolution2d_39"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_34", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_39", 0, 0]]], "name": "batchnormalization_34"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_34"}, "inbound_nodes": [[["batchnormalization_34", 0, 0]]], "name": "leakyrelu_34"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_41", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [2, 2], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_16", 0, 0]]], "name": "convolution2d_41"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_40", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_34", 0, 0]]], "name": "convolution2d_40"}, {"class_name": "Merge", "config": {"name": "merge_17", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_41", 0, 0], ["convolution2d_40", 0, 0]]], "name": "merge_17"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_35", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "batchnormalization_35"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_35"}, "inbound_nodes": [[["batchnormalization_35", 0, 0]]], "name": "leakyrelu_35"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_42", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_35", 0, 0]]], "name": "convolution2d_42"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_36", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_42", 0, 0]]], "name": "batchnormalization_36"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_36"}, "inbound_nodes": [[["batchnormalization_36", 0, 0]]], "name": "leakyrelu_36"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_44", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "convolution2d_44"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_43", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_36", 0, 0]]], "name": "convolution2d_43"}, {"class_name": "Merge", "config": {"name": "merge_18", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_44", 0, 0], ["convolution2d_43", 0, 0]]], "name": "merge_18"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_37", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_18", 0, 0]]], "name": "batchnormalization_37"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_37"}, "inbound_nodes": [[["batchnormalization_37", 0, 0]]], "name": "leakyrelu_37"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_45", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_37", 0, 0]]], "name": "convolution2d_45"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_38", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_45", 0, 0]]], "name": "batchnormalization_38"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_38"}, "inbound_nodes": [[["batchnormalization_38", 0, 0]]], "name": "leakyrelu_38"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_46", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_38", 0, 0]]], "name": "convolution2d_46"}, {"class_name": "Merge", "config": {"name": "merge_19", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_18", 0, 0], ["convolution2d_46", 0, 0]]], "name": "merge_19"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_39", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_19", 0, 0]]], "name": "batchnormalization_39"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_39"}, "inbound_nodes": [[["batchnormalization_39", 0, 0]]], "name": "leakyrelu_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_47", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_39", 0, 0]]], "name": "convolution2d_47"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_40", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_47", 0, 0]]], "name": "batchnormalization_40"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_40"}, "inbound_nodes": [[["batchnormalization_40", 0, 0]]], "name": "leakyrelu_40"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_48", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_40", 0, 0]]], "name": "convolution2d_48"}, {"class_name": "Merge", "config": {"name": "merge_20", 